[
    {
        "title": "NASA InSight's 'Mole' Is Out of Sight",
        "teaser": "Now that the heat probe is just below the Martian surface, InSight's arm will scoop some additional soil on top to help it keep digging so it can take Mars' temperature."
    },
    {
        "title": "Celebrate Mars Reconnaissance Orbiter's Views From Above",
        "teaser": "Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more."
    },
    {
        "title": "NASA's Perseverance Rover Attached to Atlas V Rocket",
        "teaser": "Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."
    },
    {
        "title": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound",
        "teaser": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."
    },
    {
        "title": "NASA Engineers Checking InSight's Weather Sensors",
        "teaser": "An electronics issue is suspected to be preventing the sensors from sharing their data about Mars weather with the spacecraft."
    },
    {
        "title": "NASA's Mars 2020 Comes Full Circle",
        "teaser": "Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL."
    },
    {
        "title": "Media Get a Close-Up of NASA's Mars 2020 Rover",
        "teaser": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."
    },
    {
        "title": "NASA's Mars 2020 Heads Into the Test Chamber",
        "teaser": "In this time-lapse video taken at JPL, engineers move the Mars 2020 rover into a large vacuum chamber for testing in Mars-like environmental conditions."
    },
    {
        "title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate",
        "teaser": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."
    },
    {
        "title": "NASA's Perseverance Rover Is Midway to Mars",
        "teaser": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."
    },
    {
        "title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities",
        "teaser": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."
    },
    {
        "title": "NASA's Perseverance Rover Bringing 3D-Printed Metal Parts to Mars",
        "teaser": "For hobbyists and makers, 3D printing expands creative possibilities; for specialized engineers, it's also key to next-generation spacecraft design."
    },
    {
        "title": "A New Video Captures the Science of NASA's Perseverance Mars Rover",
        "teaser": "With a targeted launch date of July 30, the next robotic scientist NASA is sending to the to the Red Planet has big ambitions."
    },
    {
        "title": "NASA Establishes Board to Initially Review Mars Sample Return Plans",
        "teaser": "The board will assist with analysis of current plans and goals for one of the most difficult missions humanity has ever undertaken."
    },
    {
        "title": "Three New Views of Mars' Moon Phobos",
        "teaser": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."
    }
]